package Task;


public class T12 {
    /**
     * 1. Напишите метод, который принимает массив целых чисел и массив строк, и возвращает их длины как массив из двух элементов.
     */
    public static int[] getArrayLengths(int[] intArray, String[] stringArray) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 2. Напишите метод, который принимает массив строк и массив символов,
     * и возвращает массив строк, каждая из которых начинается с соответствующего символа.
     */
    public static String[] filterStringsByChar(String[] stringArray, char[] charArray) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 3. Напишите метод, который принимает массив целых чисел и массив логических значений, и возвращает сумму всех чисел, соответствующих true в логическом массиве.
     */
    public static int sumMatchingTrue(int[] intArray, boolean[] booleanArray) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 4. Напишите метод, который принимает массив строк и массив целых чисел, и возвращает строку с самой большой длиной, если она длиннее, чем соответствующее число.
     */
    public static String getLongestStringIfLonger(String[] stringArray, int[] intArray) {
        // TODO: реализовать метод
        return "";
    }

    /**
     * 5. Напишите метод, который принимает массив символов и массив целых чисел, и возвращает массив символов, дублированных на значение из целого массива.
     */
    public static char[] duplicateCharsByNumbers(char[] charArray, int[] intArray) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 6. Напишите метод, который принимает массив логических значений и массив строк, и возвращает массив строк, соответствующих true.
     */
    public static String[] getStringsMatchingTrue(boolean[] booleanArray, String[] stringArray) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 7. Напишите метод, который принимает массив целых чисел и массив символов, и возвращает массив символов, соответствующих четным числам.
     */
    public static char[] getCharsForEvenNumbers(int[] intArray, char[] charArray) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 8. Напишите метод, который принимает два массива строк и возвращает массив строк, где каждый элемент — это конкатенация строк с одинаковыми индексами из обоих массивов.
     */
    public static String[] concatenateStringArrays(String[] array1, String[] array2) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 9. Напишите метод, который принимает массив целых чисел и массив логических значений, и возвращает true, если хотя бы одно число больше 10 и соответствует true.
     */
    public static boolean hasNumberGreaterThan10MatchingTrue(int[] intArray, boolean[] booleanArray) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 10. Напишите метод, который принимает массив строк и массив символов, и возвращает массив строк, содержащих соответствующий символ.
     */
    public static String[] getStringsContainingChar(String[] stringArray, char[] charArray) {
        // TODO: реализовать метод
        return new String[0];
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        // int[] intArray = {1, 2, 3};
        // String[] stringArray = {"one", "two", "three"};
        // System.out.println(Arrays.toString(getArrayLengths(intArray, stringArray)));
    }
}
