package Task;


public class T13 {
    /**
     * 1. Напишите метод, который принимает массив целых чисел и массив строк,
     * и выводит элементы двух массивов построчно.
     */
    public static void printArrays(int[] intArray, String[] strArray) {
        // TODO: реализовать метод
    }

    /**
     * 2. Напишите метод, который принимает массив целых чисел и массив строк,
     * и возвращает массив строк с добавлением соответствующего числа к каждой строке.
     */
    public static String[] appendNumbersToStrings(int[] intArray, String[] strArray) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 3. Напишите метод, который принимает массив целых чисел и массив логических значений,
     * и возвращает количество true для чисел, больших 10.
     */
    public static int countTrueForLargeNumbers(int[] intArray, boolean[] boolArray) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 4. Напишите метод, который принимает массив строк и массив символов,
     * и возвращает массив строк, где к каждой строке добавлен соответствующий символ.
     */
    public static String[] concatenateStringAndChar(String[] strArray, char[] charArray) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 5. Напишите метод, который принимает массив строк и массив целых чисел,
     * и возвращает сумму длин всех строк, умноженных на соответствующее число.
     */
    public static int sumStringLengthsTimesNumbers(String[] strArray, int[] intArray) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 6. Напишите метод, который принимает массив целых чисел и массив строк,
     * и возвращает true, если длина строки равна соответствующему числу.
     */
    public static boolean areStringLengthsEqualToNumbers(String[] strArray, int[] intArray) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 7. Напишите метод, который принимает массив символов и массив строк,
     * и возвращает количество строк, начинающихся с соответствующего символа.
     */
    public static int countStringsStartingWithChar(String[] strArray, char[] charArray) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 8. Напишите метод, который принимает массив целых чисел и массив логических значений,
     * и возвращает массив чисел, если соответствующее значение в логическом массиве равно true.
     */
    public static int[] filterNumbersByBoolean(int[] intArray, boolean[] boolArray) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 9. Напишите метод, который принимает два массива строк,
     * и возвращает массив, содержащий строки из первого массива, которых нет во втором.
     */
    public static String[] findUniqueStrings(String[] array1, String[] array2) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 10. Напишите метод, который принимает массив целых чисел и массив строк,
     * и возвращает строку, составленную из строк, повторенных число раз, равное соответствующему числу.
     */
    public static String repeatStringsByNumbers(String[] strArray, int[] intArray) {
        // TODO: реализовать метод
        return "";
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        // int[] intArray = {1, 2, 3};
        // String[] strArray = {"a", "b", "c"};
        // System.out.println(Arrays.toString(appendNumbersToStrings(intArray, strArray)));
    }
}