package Task;



public class T5 {

    // 1. Напишите метод, который принимает массив целых чисел и возвращает все подмассивы длиной 2.
    public static int[][] generateSubArrays(int[] array) {
        for (int i = 0; i < array.length; i++) {
            if (array[i] <= 10 && array[i] >= 99){
                System.out.println(array[i]);
            }
        }
        return new int[0][0];
    }

    /**
     * 2. Напишите метод, который принимает массив целых чисел и возвращает true, если массив является палиндромом.
     */
//    public static boolean isArrayPalindrome(int[] array) {
//        boolean n = false;
//        int w = word.lengt;
//        for (int i = 0; i < array.length; i++) {
//            for (int j = 0; j < array[i] / 2; j++) {
//                if (){
//                    n = true;
//                }
//        }
//        return n;
//    }
//    }

    /**
     * 3. Напишите метод, который принимает массив целых чисел и возвращает самый часто встречающийся элемент.
     */
    public static int findMostFrequentElement(int[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 4. Напишите метод, который принимает массив целых чисел и
     * сортирует его без использования встроенных методов сортировки.
     */
    public static int[] sortArrayManually(int[] array) {
        // TODO: реализовать метод
        return array;
    }

    /**
     * 5. Напишите метод, который принимает массив целых чисел и
     * переставляет элементы массива в случайном порядке.
     */
    public static int[] shuffleArray(int[] array) {
        // TODO: реализовать метод
        return array;
    }

    /**
     * 6. Напишите метод, который принимает массив целых
     * чисел и возвращает новый массив с уникальными элементами.
     */
    public static int[] removeDuplicates(int[] array) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 7. Напишите метод, который принимает массив целых
     * чисел и возвращает его циклически сдвинутым вправо на k позиций.
     */
    public static int[] rotateArrayRight(int[] array, int k) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 8. Напишите метод, который принимает два массива
     * целых чисел и возвращает их пересечение.
     */
    public static int[] findArrayIntersection(int[] array1, int[] array2) {
        // TODO: реализовать метод
        return new int[0];
    }

    /**
     * 9. Напишите метод, который принимает массив целых чисел и
     * возвращает true, если в массиве есть дублирующиеся элементы.
     */
    public static boolean hasDuplicates(int[] array) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 10. Напишите метод, который принимает массив целых чисел и
     * возвращает максимальную сумму подмассива (алгоритм Кадане).
     */
    public static int maxSubarraySum(int[] array) {
        // TODO: реализовать метод
        return 0;
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        int[] exampleArray = {1, 2, 3, 4, 5, 66, 52};

        //        System.out.println(generateSubArrays(exampleArray));
    }
}