package Task;


public class T6 {
    /**
     * 1. Напишите метод, который принимает массив строк и возвращает его длину.
     */
    public static int getArrayLength(String[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 2. Напишите метод, который принимает массив строк и выводит его элементы в консоль.
     */
    public static void printArray(String[] array) {
        // TODO: реализовать метод
    }

    /**
     * 3. Напишите метод, который принимает массив строк и возвращает первую строку.
     */
    public static String getFirstElement(String[] array) {
        // TODO: реализовать метод
        return "";
    }

    /**
     * 4. Напишите метод, который принимает массив строк и возвращает последнюю строку.
     */
    public static String getLastElement(String[] array) {
        // TODO: реализовать метод
        return "";
    }

    /**
     * 5. Напишите метод, который принимает массив строк и возвращает массив строк в обратном порядке.
     */
    public static String[] reverseArray(String[] array) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 6. Напишите метод, который принимает массив строк и возвращает длину самой длинной строки.
     */
    public static int getLongestStringLength(String[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 7. Напишите метод, который принимает массив строк и возвращает строку с максимальной длиной.
     */
    public static String getLongestString(String[] array) {
        // TODO: реализовать метод
        return "";
    }

    /**
     * 8. Напишите метод, который принимает массив строк и возвращает true, если массив содержит заданную строку.
     */
    public static boolean containsString(String[] array, String target) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 9. Напишите метод, который принимает массив строк и возвращает количество строк, которые начинаются с заданной буквы.
     */
    public static int countStringsStartingWith(String[] array, char letter) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 10. Напишите метод, который принимает массив строк и возвращает массив строк в верхнем регистре.
     */
    public static String[] convertToUpperCase(String[] array) {
        // TODO: реализовать метод
        return new String[0];
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        // String[] exampleArray = {"apple", "banana", "cherry"};
        // System.out.println(getArrayLength(exampleArray));
    }
}
