package Task;



public class T7 {
    /**
     * 1. Напишите метод, который принимает массив строк и возвращает массив строк, отсортированный в лексикографическом порядке.
     */
    public static String[] sortArray(String[] array) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 2. Напишите метод, который принимает массив строк и возвращает самую часто встречающуюся строку.
     */
    public static String findMostFrequentString(String[] array) {
        // TODO: реализовать метод
        return "";
    }

    /**
     * 3. Напишите метод, который принимает массив строк и возвращает массив только уникальных строк.
     */
    public static String[] getUniqueStrings(String[] array) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 4. Напишите метод, который принимает два массива строк и возвращает массив строк, которые присутствуют в обоих массивах.
     */
    public static String[] findCommonStrings(String[] array1, String[] array2) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 5. Напишите метод, который принимает массив строк и возвращает массив строк, которые являются палиндромами.
     */
    public static String[] findPalindromes(String[] array) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 6. Напишите метод, который принимает массив строк и удаляет строки, содержащие заданное слово.
     */
    public static String[] removeStringsContainingWord(String[] array, String word) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 7. Напишите метод, который принимает массив строк и возвращает строку с наибольшим количеством гласных.
     */
    public static String findStringWithMostVowels(String[] array) {
        // TODO: реализовать метод
        return "";
    }

    /**
     * 8. Напишите метод, который принимает массив строк и возвращает массив строк, содержащих только буквы (без цифр или специальных символов).
     */
    public static String[] filterAlphabeticStrings(String[] array) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 9. Напишите метод, который принимает массив строк и возвращает массив строк, где каждая строка перевернута (reverse).
     */
    public static String[] reverseEachString(String[] array) {
        // TODO: реализовать метод
        return new String[0];
    }

    /**
     * 10. Напишите метод, который принимает массив строк и возвращает массив строк, сгруппированных по их длине (каждая группа отдельный элемент массива).
     */
    public static String[][] groupStringsByLength(String[] array) {
        // TODO: реализовать метод
        return new String[0][0];
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        // String[] exampleArray = {"apple", "banana", "radar", "123", "level"};
        // System.out.println(Arrays.toString(sortArray(exampleArray)));
    }
}