package Task;



public class T8 {
    /**
     * 1. Напишите метод, который принимает массив символов и возвращает его длину.
     */
    public static int getArrayLength(char[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 2. Напишите метод, который принимает массив символов и выводит его элементы в консоль.
     */
    public static void printArray(char[] array) {
        // TODO: реализовать метод
    }

    /**
     * 3. Напишите метод, который принимает массив символов и возвращает первый символ.
     */
    public static char getFirstElement(char[] array) {
        // TODO: реализовать метод
        return ' ';
    }

    /**
     * 4. Напишите метод, который принимает массив символов и возвращает последний символ.
     */
    public static char getLastElement(char[] array) {
        // TODO: реализовать метод
        return ' ';
    }

    /**
     * 5. Напишите метод, который принимает массив символов и возвращает массив в обратном порядке.
     */
    public static char[] reverseArray(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 6. Напишите метод, который принимает массив символов и возвращает количество гласных букв в массиве.
     */
    public static int countVowels(char[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 7. Напишите метод, который принимает массив символов и заменяет все буквы на заглавные.
     */
    public static char[] toUpperCase(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 8. Напишите метод, который принимает массив символов и проверяет, является ли он палиндромом.
     */
    public static boolean isPalindrome(char[] array) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 9. Напишите метод, который принимает массив символов и возвращает количество пробелов в массиве.
     */
    public static int countSpaces(char[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 10. Напишите метод, который принимает массив символов и заменяет все цифры на символ '*'.
     */
    public static char[] replaceDigitsWithAsterisk(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        // char[] exampleArray = {'a', 'b', 'c', '1', '2', ' ', 'e'};
        // System.out.println(getArrayLength(exampleArray));
    }
}