package Task;


public class T9 {
    /**
     * 1. Напишите метод, который принимает массив символов и возвращает массив уникальных символов.
     */
    public static char[] getUniqueCharacters(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 2. Напишите метод, который принимает массив символов и возвращает количество согласных букв.
     */
    public static int countConsonants(char[] array) {
        // TODO: реализовать метод
        return 0;
    }

    /**
     * 3. Напишите метод, который принимает массив символов и возвращает массив символов без пробелов.
     */
    public static char[] removeSpaces(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 4. Напишите метод, который принимает массив символов и возвращает массив, содержащий только буквы.
     */
    public static char[] filterLetters(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 5. Напишите метод, который принимает массив символов и возвращает самое часто встречающееся значение.
     */
    public static char findMostFrequentChar(char[] array) {
        // TODO: реализовать метод
        return ' ';
    }

    /**
     * 6. Напишите метод, который принимает массив символов и возвращает массив, где каждый символ увеличен на 1 в ASCII-коде.
     */
    public static char[] shiftCharactersByOne(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 7. Напишите метод, который принимает два массива символов и возвращает их объединение в один массив.
     */
    public static char[] mergeCharArrays(char[] array1, char[] array2) {
        // TODO: реализовать метод
        return new char[0];
    }

    /**
     * 8. Напишите метод, который принимает массив символов и возвращает true, если все символы являются буквами.
     */
    public static boolean areAllLetters(char[] array) {
        // TODO: реализовать метод
        return false;
    }

    /**
     * 9. Напишите метод, который принимает массив символов и возвращает строку, составленную из символов массива.
     */
    public static String convertToString(char[] array) {
        // TODO: реализовать метод
        return "";
    }

    /**
     * 10. Напишите метод, который принимает массив символов и возвращает массив, в котором дубликаты заменены на символ '_'.
     */
    public static char[] replaceDuplicatesWithUnderscore(char[] array) {
        // TODO: реализовать метод
        return new char[0];
    }

    public static void main(String[] args) {
        // Пример вызовов методов (после их реализации)
        // char[] exampleArray = {'a', 'b', 'c', 'a', ' ', 'd', '1'};
        // System.out.println(Arrays.toString(getUniqueCharacters(exampleArray)));
    }
}
